B35doc/English/online/elbug_C2/samples/managelinks/ExampleForManageLinks.xml

<SOAP_ENV:Envelope xmlns:SOAP_ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ixf="http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns="IXF_Schema.xsd" xsi:schemaLocation="IXF_Schema.xsd ElectricalSchema.xsd" xmlns:NS1="CATIA/V5/Electrical/1.0" xmlns:NS2="http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0">
<SOAP_ENV:Body>
<ixf:object xsi:type="tns:Equipment" id="P212-Equipment_Id1">
    <tns:Name>P212-1</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>P212-Equipment</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object xsi:type="tns:Equipment" id="P212-Equipment_Id2">
    <tns:Name>P212-2</tns:Name>
  <NS1:Product>
    <NS1:PartNumber>P212-Equipment</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
</SOAP_ENV:Body>
</SOAP_ENV:Envelope>
